app/views/search/search.html.erb

					<% if current_user.following?(date) %>
						<%= form_for(current_user.relationships.find_by(follow_id: date.id),
							html:{method: :delete}) do |f|  %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 1], ["follow_id", 2], ["LIMIT", 1]]

			<%= link_to book_path(date) do %>
			<%= date.book_comments.count %>件<% end %>
---
SELECT "books".* FROM "books" WHERE (title LIKE '%test%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]