app/views/book_comments/_index.html.erb

INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-06-04 09:58:29.580450"], ["updated_at", "2020-06-04 09:58:29.580450"]]
---
			<td class="align-middle"><%= comment.comment %></td>
			<td class="align-middle"><%= comment.created_at.strftime('%Y/%m/%d') %></td>