app/views/users/show.html.erb

				<td class="align-middle"><%= book.body %></td>
				<td class="align-middle">コメント:<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]