app/views/books/index.html.erb

					<%= link_to book_path(book) do %>
					<%= book.book_comments.count %>件<% end %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]