app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
	def index
		@user = User.find(current_user.id)
		@book_new = Book.new
		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@book = Book.find(params[:id])
		@user = User.find(@book.user_id)