app/controllers/book_comments_controller.rb

	def create
		book = Book.find(params[:book_id])
		book_comment = BookComment.new(book_comment_params)
		book_comment.user_id = current_user.id
		book_comment.book_id = book.id
		if book_comment.save
			flash[:notice] = "コメントを投稿しました！"
			redirect_to book_path(book)
		elsif book_comment.comment.empty?
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test ajax"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-06-04 07:41:39.495421"], ["updated_at", "2020-06-04 07:41:39.495421"]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]

	def destroy
		book = Book.find(params[:book_id])
		book_comment = current_user.book_comments.find_by(book_id: book.id)
		book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 3]]