app/controllers/chats_controller.rb

	def show
		@user = User.find(params[:id])
		rooms = current_user.user_rooms.pluck(:room_id)
		user_rooms = UserRoom.find_by(user_id: @user.id, room_id: rooms)

		unless user_rooms.nil?
			@room = user_rooms.room
		else
			@room = Room.new
			@room.save
			UserRoom.create(user_id: current_user.id, room_id: @room.id)
			UserRoom.create(user_id: @user.id, room_id: @room.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-06-08 11:31:43.514633"], ["updated_at", "2020-06-08 11:31:43.514633"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2020-06-08 11:31:43.602910"], ["updated_at", "2020-06-08 11:31:43.602910"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2020-06-08 11:31:43.652119"], ["updated_at", "2020-06-08 11:31:43.652119"]]

	def create
		@chat = current_user.chats.new(chat_params)
		@chat.save
---
INSERT INTO "chats" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["message", "test2"], ["created_at", "2020-06-08 11:46:57.785620"], ["updated_at", "2020-06-08 11:46:57.785620"]]