app/controllers/favorites_controller.rb

	def create
		@book = Book.find(params[:book_id])
    	@favorite = Favorite.create(user_id: current_user.id, book_id: @book.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2020-06-04 06:55:21.498613"], ["updated_at", "2020-06-04 06:55:21.498613"]]

	def destroy
		@book = Book.find(params[:book_id])
    	@favorite = Favorite.find_by(user_id: current_user.id, book_id: @book.id)
		@favorite.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 78]]